Tekla Open API Reference for Tekla Structures 2025
RebarPropertyModifier Properties
The RebarPropertyModifier type exposes the following members.
Properties
Name | Description
AffectsWholeBarPlane
 Gets or sets a value indicating whether the modifier affects all bars in the plane or just those that it touches.
BarsAffected
 Gets or sets the reinforcing bars affected.
 (Inherited from BaseRebarModifier.)
Curve
 Gets or sets the geometric Contour of the rebar modifier.
 (Inherited from BaseRebarModifier.)
Father
 Gets or sets the RebarSet to which the modifier belongs. Only reinforcing bars generated by this RebarSet can be modified by this rebar modifier.
 (Inherited from BaseRebarModifier.)
FatherPart
 Gets or sets the father part for all bars touching the property modifier.
FirstAffectedBar
 Gets or sets the first affected bar. If set to zero, the first affected bar will be chosen automatically.
 (Inherited from BaseRebarModifier.)
FollowEdges
 Gets or sets a flag that indicates whether the modifier should attempt to follow the leg face edges located between its end points.
 (Inherited from BaseRebarModifier.)
GroupingType
 Gets or sets the grouping type.
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
RebarProperties
 Gets or sets the reinforcing bar properties.
SpacingOverride
 Gets or sets the spacing override.
Top
See Also
Reference
RebarPropertyModifier Class
Tekla.Structures.Model Namespace